In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
data = np.arange(8)

In [3]:
data

array([0, 1, 2, 3, 4, 5, 6, 7])

In [4]:
index = ['row 1','row 2','row 3','row 4','row 5','row 6','row 7','row 8']

In [5]:
index

['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6', 'row 7', 'row 8']

In [6]:
series_obj = Series(data,index)

In [7]:
series_obj

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int64

In [8]:
series_obj['row 7']

6

In [9]:
series_obj[7]

7

In [10]:
series_obj[[0,7]]

row 1    0
row 8    7
dtype: int64

In [11]:
df = DataFrame(np.random.rand(36).reshape((6,6)), 
              index = ['row 1','row 2','row 3','row 4','row 5','row 6'],
              columns = ['column 1', 'column 2', 'column 3', 'column 4', 'column 5', 'column 6'])

In [12]:
df

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.172040  0.260091  0.019349  0.105439  0.279387  0.039696
row 2  0.268980  0.386444  0.751366  0.535386  0.695913  0.433493
row 3  0.920334  0.707356  0.332656  0.695032  0.695623  0.045428
row 4  0.637348  0.352674  0.878975  0.595588  0.573309  0.063894
row 5  0.049273  0.775565  0.576042  0.895887  0.508798  0.286370
row 6  0.781165  0.376321  0.575407  0.800661  0.970760  0.856534

In [13]:
df.loc[['row 1', 'row 2'], ['column 1', 'column 2']]

       column 1  column 2
row 1   0.17204  0.260091
row 2   0.26898  0.386444

In [14]:
series_obj['row 3': 'row 6']

row 3    2
row 4    3
row 5    4
row 6    5
dtype: int64

In [15]:
series_obj['row 3': 'row 6' : -1]

Series([], dtype: int64)

In [16]:
series_obj['row 3'::]

row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int64

In [17]:
series_obj[: 'row 6':]

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
dtype: int64

In [18]:
df['row 1': 'row 5']

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.172040  0.260091  0.019349  0.105439  0.279387  0.039696
row 2  0.268980  0.386444  0.751366  0.535386  0.695913  0.433493
row 3  0.920334  0.707356  0.332656  0.695032  0.695623  0.045428
row 4  0.637348  0.352674  0.878975  0.595588  0.573309  0.063894
row 5  0.049273  0.775565  0.576042  0.895887  0.508798  0.286370

In [19]:
df.loc[['row 1', 'row 5'],['column 2','column 5']]

       column 2  column 5
row 1  0.260091  0.279387
row 5  0.775565  0.508798

In [20]:
#Checking if individual values in the DF is greaer than 0.5

In [21]:
df>0.5

       column 1  column 2  column 3  column 4  column 5  column 6
row 1     False     False     False     False     False     False
row 2     False     False      True      True      True     False
row 3      True      True     False      True      True     False
row 4      True     False      True      True      True     False
row 5     False      True      True      True      True     False
row 6      True     False      True      True      True      True

In [22]:
series_obj[series_obj > 5]

row 7    6
row 8    7
dtype: int64

In [23]:
df_gt5 = df[df > 0.5] #Need to check how the NaN can be set to 0 in a single statement

In [24]:
df_gt5

       column 1  column 2  column 3  column 4  column 5  column 6
row 1       NaN       NaN       NaN       NaN       NaN       NaN
row 2       NaN       NaN  0.751366  0.535386  0.695913       NaN
row 3  0.920334  0.707356       NaN  0.695032  0.695623       NaN
row 4  0.637348       NaN  0.878975  0.595588  0.573309       NaN
row 5       NaN  0.775565  0.576042  0.895887  0.508798       NaN
row 6  0.781165       NaN  0.575407  0.800661  0.970760  0.856534

In [25]:
df_gt5.isnull()

       column 1  column 2  column 3  column 4  column 5  column 6
row 1      True      True      True      True      True      True
row 2      True      True     False     False     False      True
row 3     False     False      True     False     False      True
row 4     False      True     False     False     False      True
row 5      True     False     False     False     False      True
row 6     False      True     False     False     False     False

In [26]:
filled_df = df_gt5.fillna(0)
# fillna({0:0.1, 5:1.25}) 
# for filling all Nan values in 
#      0th index with 0.1 
#      5th index with 1.25

In [27]:
filled_df

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.000000  0.000000  0.000000  0.000000  0.000000  0.000000
row 2  0.000000  0.000000  0.751366  0.535386  0.695913  0.000000
row 3  0.920334  0.707356  0.000000  0.695032  0.695623  0.000000
row 4  0.637348  0.000000  0.878975  0.595588  0.573309  0.000000
row 5  0.000000  0.775565  0.576042  0.895887  0.508798  0.000000
row 6  0.781165  0.000000  0.575407  0.800661  0.970760  0.856534

In [28]:
df2 = DataFrame(np.arange(36).reshape(6,6))

In [29]:
df2

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [30]:
df3 = DataFrame(np.random.rand(36).reshape((6,6)), 
              index = ['row 1','row 2','row 3','row 4','row 5','row 6'],
              columns = ['column 1', 'column 2', 'column 3', 'column 4', 'column 5', 'column 6'])

In [31]:
df3

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.017358  0.560526  0.239057  0.275866  0.237048  0.528918
row 2  0.511003  0.380331  0.261488  0.198207  0.550877  0.580547
row 3  0.416139  0.619459  0.477895  0.455417  0.404403  0.166441
row 4  0.183012  0.209333  0.595722  0.551433  0.835174  0.898082
row 5  0.812324  0.143891  0.282878  0.044594  0.624082  0.650394
row 6  0.073485  0.260030  0.208001  0.689925  0.731661  0.337722

In [33]:
#Concatenating dataframes

Df_obj1 = DataFrame(np.arange(36).reshape(6,6))
Df_obj2 = DataFrame(np.arange(15).reshape(5,3))

In [34]:
Df_obj1

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [35]:
Df_obj2

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [36]:
pd.concat([Df_obj1, Df_obj2], axis=1)

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [37]:
pd.concat([Df_obj1, Df_obj2])

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

In [44]:
df3

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.017358  0.560526  0.239057  0.275866  0.237048  0.528918
row 2  0.511003  0.380331  0.261488  0.198207  0.550877  0.580547
row 3  0.416139  0.619459  0.477895  0.455417  0.404403  0.166441
row 4  0.183012  0.209333  0.595722  0.551433  0.835174  0.898082
row 5  0.812324  0.143891  0.282878  0.044594  0.624082  0.650394
row 6  0.073485  0.260030  0.208001  0.689925  0.731661  0.337722